app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'R', "director" = 'Ben Affleck', "description" = 'Argo is a 2012 historical drama thriller film directed by Ben Affleck. This dramatization is adapted from the book The Master of Disguise by CIA operative Tony Mendez, and Joshuah Berman''s 2007 Wired ...', "release_date" = '2013-02-19 00:00:00.000000', "updated_at" = '2013-03-24 07:13:51.089940' WHERE "movies"."id" = 11

  def movies_by_director
	id = params[:movie_id]
	movie = Movie.find(id)

	if movie.director.to_s.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Ron Clements'